Схема баз данных:
https://sql-ex.ru/help/select13.php#db_1
https://docs.google.com/document/d/1NVORWgdwlKepKq_b8SPRaSpraltxoMg2SIusTEN6mEQ/edit?usp=sharing

--task1 (lesson5)
-- Компьютерная фирма: Сделать запрос с количеством товаров (название count_products_by_makers) по каждому производителю. Во view: maker, count
-- По предыдущему запросу (count_products_by_makers) сделать график в grafana (X: maker, y: count)

--task2.1 (lesson5)
-- Корабли: Сделать запрос c количеством потопленных кораблей и классом корабля (название sunk_ships_by_classes). Во view: count, class (если значения класса нет/IS NULL, то заменить на 0)
-- Корабли: По предыдущему запросу (sunk_ships_by_classes) сделать график в grafana (X: class, Y: count)

--task3.1 (lesson5)
-- Корабли: Взять таблицу classes (название classes_with_flag) и добавить в нее flag: если количество орудий больше или равно 9 - то 1, иначе 0
-- По флагу нужно построить распределение в grafana (X: флаг, Y: количество)

--task3.2 (lesson5)
-- Корабли: Сделать график в grafana по таблице classes с количеством классов по странам (X: country, Y: count)

--task5 (lesson5)
--Компьютерная фирма: Вывести список всех продуктов и производителя с указанием типа продукта (pc, printer, laptop). Вывести: model, maker, type
-- Построить график в grafana

--task6 (lesson5)
--Корабли: Сделать график по распределению утопленных и раненных кораблей в рамках каждой битвы. (Y1: количество потопленных кораблей; Y2: Количество раненных кораблей; X: битва)

--task7 (lesson6)
--Компьютерная фирма: Сделать стори, где для каждого производителя в рамках страницы будет указано количество товаров в зависимости от типа товара и средняя цена.
--Визуализация на ваше усмотрение
